ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/R5SS_STC_53500000h.xml
		<bitfield id="C2MISR20" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31:0" rwaccess="R"/>
	</register><register id="STC_CORE2_CURMISR_21" acronym="STC_CORE2_CURMISR_21" offset="256" width="32" description="Holds the MISR signature for CORE2.">
		<bitfield id="C2MISR21" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31:0" rwaccess="R"/>
	</register><register id="STC_CORE2_CURMISR_22" acronym="STC_CORE2_CURMISR_22" offset="260" width="32" description="Holds the MISR signature for CORE2.">
		<bitfield id="C2MISR22" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31:0" rwaccess="R"/>
	</register><register id="STC_CORE2_CURMISR_23" acronym="STC_CORE2_CURMISR_23" offset="264" width="32" description="Holds the MISR signature for CORE2.">
		<bitfield id="C2MISR23" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31:0" rwaccess="R"/>
	</register><register id="STC_CORE2_CURMISR_24" acronym="STC_CORE2_CURMISR_24" offset="268" width="32" description="Holds the MISR signature for CORE2.">
		<bitfield id="C2MISR24" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31:0" rwaccess="R"/>
	</register><register id="STC_CORE2_CURMISR_25" acronym="STC_CORE2_CURMISR_25" offset="272" width="32" description="Holds the MISR signature for CORE2.">
		<bitfield id="C2MISR25" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31:0" rwaccess="R"/>
	</register><register id="STC_CORE2_CURMISR_26" acronym="STC_CORE2_CURMISR_26" offset="276" width="32" description="Holds the MISR signature for CORE2.">
		<bitfield id="C2MISR26" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31:0" rwaccess="R"/>
	</register><register id="STC_CORE2_CURMISR_27" acronym="STC_CORE2_CURMISR_27" offset="280" width="32" description="Holds the MISR signature for CORE2.">
		<bitfield id="C2MISR27" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31:0" rwaccess="R"/>
	</register>
</module>